SaraEye/SaraKIT-dsPIC33-bldc-gimbal-motors-with-encoders-SPI-DMA/lsm6ds3tr-c_reg.h
#define LSM6DS3TR_C_CTRL7_G                      0x16U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used_01              : 2;
  uint8_t rounding_status          : 1;
  uint8_t not_used_02              : 1;
  uint8_t hpm_g                    : 2;
  uint8_t hp_en_g                  : 1;
  uint8_t g_hm_mode                : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t g_hm_mode                : 1;
  uint8_t hp_en_g                  : 1;
  uint8_t hpm_g                    : 2;
  uint8_t not_used_02              : 1;
  uint8_t rounding_status          : 1;
  uint8_t not_used_01              : 2;
#endif /* DRV_BYTE_ORDER */
} lsm6ds3tr_c_ctrl7_g_t;

#define LSM6DS3TR_C_CTRL8_XL                     0x17U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t low_pass_on_6d           : 1;
  uint8_t not_used_01              : 1;
  uint8_t hp_slope_xl_en           : 1;
  uint8_t input_composite          : 1;
  uint8_t hp_ref_mode              : 1;
  uint8_t hpcf_xl                  : 2;
  uint8_t lpf2_xl_en               : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t lpf2_xl_en               : 1;
  uint8_t hpcf_xl                  : 2;
  uint8_t hp_ref_mode              : 1;
  uint8_t input_composite          : 1;
  uint8_t hp_slope_xl_en           : 1;
  uint8_t not_used_01              : 1;
  uint8_t low_pass_on_6d           : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6ds3tr_c_ctrl8_xl_t;

#define LSM6DS3TR_C_CTRL9_XL                     0x18U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used_01              : 2;
  uint8_t soft_en                  : 1;
  uint8_t not_used_02              : 1;
  uint8_t den_xl_g                 : 1;
  uint8_t den_z                    : 1;
  uint8_t den_y                    : 1;
  uint8_t den_x                    : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t den_x                    : 1;
  uint8_t den_y                    : 1;
  uint8_t den_z                    : 1;
  uint8_t den_xl_g                 : 1;
  uint8_t not_used_02              : 1;
  uint8_t soft_en                  : 1;
  uint8_t not_used_01              : 2;
#endif /* DRV_BYTE_ORDER */
} lsm6ds3tr_c_ctrl9_xl_t;

#define LSM6DS3TR_C_CTRL10_C                     0x19U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t sign_motion_en           : 1;
  uint8_t pedo_rst_step            : 1;
  uint8_t func_en                  : 1;
  uint8_t tilt_en                  : 1;
  uint8_t pedo_en                  : 1;
  uint8_t timer_en                 : 1;
  uint8_t not_used_01              : 1;
  uint8_t wrist_tilt_en            : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t wrist_tilt_en            : 1;
  uint8_t not_used_01              : 1;
  uint8_t timer_en                 : 1;
  uint8_t pedo_en                  : 1;
  uint8_t tilt_en                  : 1;
  uint8_t func_en                  : 1;
  uint8_t pedo_rst_step            : 1;
  uint8_t sign_motion_en           : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6ds3tr_c_ctrl10_c_t;

#define LSM6DS3TR_C_MASTER_CONFIG                0x1AU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t master_on                : 1;
  uint8_t iron_en                  : 1;
  uint8_t pass_through_mode        : 1;
  uint8_t pull_up_en               : 1;
  uint8_t start_config             : 1;
  uint8_t not_used_01              : 1;
  uint8_t data_valid_sel_fifo      : 1;
  uint8_t drdy_on_int1             : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t drdy_on_int1             : 1;
  uint8_t data_valid_sel_fifo      : 1;
  uint8_t not_used_01              : 1;
  uint8_t start_config             : 1;
  uint8_t pull_up_en               : 1;
  uint8_t pass_through_mode        : 1;
  uint8_t iron_en                  : 1;
  uint8_t master_on                : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6ds3tr_c_master_config_t;


#define LSM6DS3TR_C_STATUS_REG                   0x1EU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t xlda                     : 1;
  uint8_t gda                      : 1;
  uint8_t tda                      : 1;
  uint8_t not_used_01              : 5;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_01              : 5;
  uint8_t tda                      : 1;
  uint8_t gda                      : 1;
  uint8_t xlda                     : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6ds3tr_c_status_reg_t;

#define LSM6DS3TR_C_OUT_TEMP_L                   0x20U
#define LSM6DS3TR_C_OUT_TEMP_H                   0x21U
#define LSM6DS3TR_C_OUTX_L_G                     0x22U
#define LSM6DS3TR_C_OUTX_H_G                     0x23U
#define LSM6DS3TR_C_OUTY_L_G                     0x24U
#define LSM6DS3TR_C_OUTY_H_G                     0x25U
#define LSM6DS3TR_C_OUTZ_L_G                     0x26U
#define LSM6DS3TR_C_OUTZ_H_G                     0x27U
#define LSM6DS3TR_C_OUTX_L_XL                    0x28U
#define LSM6DS3TR_C_OUTX_H_XL                    0x29U
#define LSM6DS3TR_C_OUTY_L_XL                    0x2AU
#define LSM6DS3TR_C_OUTY_H_XL                    0x2BU
#define LSM6DS3TR_C_OUTZ_L_XL                    0x2CU
#define LSM6DS3TR_C_OUTZ_H_XL                    0x2DU

#define LSM6DS3TR_C_FIFO_DATA_OUT_L              0x3EU
#define LSM6DS3TR_C_FIFO_DATA_OUT_H              0x3FU
#define LSM6DS3TR_C_TIMESTAMP0_REG               0x40U
#define LSM6DS3TR_C_TIMESTAMP1_REG               0x41U
#define LSM6DS3TR_C_TIMESTAMP2_REG               0x42U
#define LSM6DS3TR_C_STEP_TIMESTAMP_L             0x49U
#define LSM6DS3TR_C_STEP_TIMESTAMP_H             0x4AU
#define LSM6DS3TR_C_STEP_COUNTER_L               0x4BU
#define LSM6DS3TR_C_STEP_COUNTER_H               0x4CU

#define LSM6DS3TR_C_WRIST_TILT_IA                0x55U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used_01              : 2;
  uint8_t wrist_tilt_ia_zneg       : 1;
  uint8_t wrist_tilt_ia_zpos       : 1;
  uint8_t wrist_tilt_ia_yneg       : 1;
  uint8_t wrist_tilt_ia_ypos       : 1;
  uint8_t wrist_tilt_ia_xneg       : 1;
  uint8_t wrist_tilt_ia_xpos       : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t wrist_tilt_ia_xpos       : 1;
  uint8_t wrist_tilt_ia_xneg       : 1;
  uint8_t wrist_tilt_ia_ypos       : 1;
  uint8_t wrist_tilt_ia_yneg       : 1;
  uint8_t wrist_tilt_ia_zpos       : 1;
  uint8_t wrist_tilt_ia_zneg       : 1;
  uint8_t not_used_01              : 2;
#endif /* DRV_BYTE_ORDER */
} lsm6ds3tr_c_wrist_tilt_ia_t;

