SaraEye/SaraKIT-dsPIC33-bldc-gimbal-motors-with-encoders-SPI-DMA/lsm6ds3tr-c_reg.h
#define LSM6DS3TR_C_SM_THS                       0x13U
#define LSM6DS3TR_C_PEDO_DEB_REG                 0x14U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t deb_step      : 3;
  uint8_t deb_time      : 5;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t deb_time      : 5;
  uint8_t deb_step      : 3;
#endif /* DRV_BYTE_ORDER */
} lsm6ds3tr_c_pedo_deb_reg_t;

#define LSM6DS3TR_C_STEP_COUNT_DELTA             0x15U
#define LSM6DS3TR_C_MAG_SI_XX                    0x24U
#define LSM6DS3TR_C_MAG_SI_XY                    0x25U
#define LSM6DS3TR_C_MAG_SI_XZ                    0x26U
#define LSM6DS3TR_C_MAG_SI_YX                    0x27U
#define LSM6DS3TR_C_MAG_SI_YY                    0x28U
#define LSM6DS3TR_C_MAG_SI_YZ                    0x29U
#define LSM6DS3TR_C_MAG_SI_ZX                    0x2AU
#define LSM6DS3TR_C_MAG_SI_ZY                    0x2BU
#define LSM6DS3TR_C_MAG_SI_ZZ                    0x2CU
#define LSM6DS3TR_C_MAG_OFFX_L                   0x2DU
#define LSM6DS3TR_C_MAG_OFFX_H                   0x2EU
#define LSM6DS3TR_C_MAG_OFFY_L                   0x2FU
#define LSM6DS3TR_C_MAG_OFFY_H                   0x30U
#define LSM6DS3TR_C_MAG_OFFZ_L                   0x31U
#define LSM6DS3TR_C_MAG_OFFZ_H                   0x32U

/**
  * @defgroup LSM6DS3TR_C_Register_Union
  * @brief    This union group all the registers having a bit-field
  *           description.
  *           This union is useful but it's not needed by the driver.
  *
  *           REMOVING this union you are compliant with:
  *           MISRA-C 2012 [Rule 19.2] -> " Union are not allowed "
  *
  * @{
  *
  */
typedef union
{
  lsm6ds3tr_c_func_cfg_access_t                  func_cfg_access;
  lsm6ds3tr_c_sensor_sync_time_frame_t           sensor_sync_time_frame;
  lsm6ds3tr_c_sensor_sync_res_ratio_t            sensor_sync_res_ratio;
  lsm6ds3tr_c_fifo_ctrl1_t                       fifo_ctrl1;
  lsm6ds3tr_c_fifo_ctrl2_t                       fifo_ctrl2;
  lsm6ds3tr_c_fifo_ctrl3_t                       fifo_ctrl3;
  lsm6ds3tr_c_fifo_ctrl4_t                       fifo_ctrl4;
  lsm6ds3tr_c_fifo_ctrl5_t                       fifo_ctrl5;
  lsm6ds3tr_c_drdy_pulse_cfg_g_t                 drdy_pulse_cfg_g;
  lsm6ds3tr_c_int1_ctrl_t                        int1_ctrl;
  lsm6ds3tr_c_int2_ctrl_t                        int2_ctrl;
  lsm6ds3tr_c_master_config_t                    master_config;
  lsm6ds3tr_c_status_reg_t                       status_reg;
  lsm6ds3tr_c_md1_cfg_t                          md1_cfg;
  lsm6ds3tr_c_md2_cfg_t                          md2_cfg;
  lsm6ds3tr_c_master_cmd_code_t                  master_cmd_code;
  lsm6ds3tr_c_sens_sync_spi_error_code_t
  sens_sync_spi_error_code;
  lsm6ds3tr_c_config_pedo_ths_min_t              config_pedo_ths_min;
  lsm6ds3tr_c_pedo_deb_reg_t                     pedo_deb_reg;
  bitwise_t                                  bitwise;
  uint8_t                                    byte;
} lsm6ds3tr_c_reg_t;

/**
  * @}
  *
  */

int32_t lsm6ds3tr_c_read_reg(stmdev_ctx_t *ctx, uint8_t reg,
                             uint8_t *data,
                             uint16_t len);
int32_t lsm6ds3tr_c_write_reg(stmdev_ctx_t *ctx, uint8_t reg,
                              uint8_t *data,
                              uint16_t len);

typedef enum
{
  LSM6DS3TR_C_2g       = 0,
  LSM6DS3TR_C_16g      = 1,
  LSM6DS3TR_C_4g       = 2,
  LSM6DS3TR_C_8g       = 3,
  LSM6DS3TR_C_XL_FS_ND = 4,  /* ERROR CODE */
} lsm6ds3tr_c_fs_xl_t;
int32_t lsm6ds3tr_c_xl_full_scale_set(stmdev_ctx_t *ctx,
                                      lsm6ds3tr_c_fs_xl_t val);
int32_t lsm6ds3tr_c_xl_full_scale_get(stmdev_ctx_t *ctx,
                                      lsm6ds3tr_c_fs_xl_t *val);

typedef enum
{
  LSM6DS3TR_C_XL_ODR_OFF      =  0,
  LSM6DS3TR_C_XL_ODR_12Hz5    =  1,
  LSM6DS3TR_C_XL_ODR_26Hz     =  2,
  LSM6DS3TR_C_XL_ODR_52Hz     =  3,
  LSM6DS3TR_C_XL_ODR_104Hz    =  4,
  LSM6DS3TR_C_XL_ODR_208Hz    =  5,
  LSM6DS3TR_C_XL_ODR_416Hz    =  6,
  LSM6DS3TR_C_XL_ODR_833Hz    =  7,
  LSM6DS3TR_C_XL_ODR_1k66Hz   =  8,
  LSM6DS3TR_C_XL_ODR_3k33Hz   =  9,
  LSM6DS3TR_C_XL_ODR_6k66Hz   = 10,
  LSM6DS3TR_C_XL_ODR_1Hz6     = 11,
  LSM6DS3TR_C_XL_ODR_ND       = 12,  /* ERROR CODE */
} lsm6ds3tr_c_odr_xl_t;
int32_t lsm6ds3tr_c_xl_data_rate_set(stmdev_ctx_t *ctx,
                                     lsm6ds3tr_c_odr_xl_t val);
int32_t lsm6ds3tr_c_xl_data_rate_get(stmdev_ctx_t *ctx,
                                     lsm6ds3tr_c_odr_xl_t *val);

typedef enum
{
  LSM6DS3TR_C_250dps     = 0,
  LSM6DS3TR_C_125dps     = 1,
  LSM6DS3TR_C_500dps     = 2,
  LSM6DS3TR_C_1000dps    = 4,
  LSM6DS3TR_C_2000dps    = 6,
  LSM6DS3TR_C_GY_FS_ND   = 7,    /* ERROR CODE */
} lsm6ds3tr_c_fs_g_t;
int32_t lsm6ds3tr_c_gy_full_scale_set(stmdev_ctx_t *ctx,
                                      lsm6ds3tr_c_fs_g_t val);
int32_t lsm6ds3tr_c_gy_full_scale_get(stmdev_ctx_t *ctx,
                                      lsm6ds3tr_c_fs_g_t *val);

typedef enum
{
  LSM6DS3TR_C_GY_ODR_OFF    =  0,
  LSM6DS3TR_C_GY_ODR_12Hz5  =  1,
  LSM6DS3TR_C_GY_ODR_26Hz   =  2,
  LSM6DS3TR_C_GY_ODR_52Hz   =  3,
  LSM6DS3TR_C_GY_ODR_104Hz  =  4,
  LSM6DS3TR_C_GY_ODR_208Hz  =  5,
  LSM6DS3TR_C_GY_ODR_416Hz  =  6,
  LSM6DS3TR_C_GY_ODR_833Hz  =  7,
  LSM6DS3TR_C_GY_ODR_1k66Hz =  8,
  LSM6DS3TR_C_GY_ODR_3k33Hz =  9,
  LSM6DS3TR_C_GY_ODR_6k66Hz = 10,
  LSM6DS3TR_C_GY_ODR_ND     = 11,    /* ERROR CODE */
} lsm6ds3tr_c_odr_g_t;
int32_t lsm6ds3tr_c_gy_data_rate_set(stmdev_ctx_t *ctx,
                                     lsm6ds3tr_c_odr_g_t val);
int32_t lsm6ds3tr_c_gy_data_rate_get(stmdev_ctx_t *ctx,
                                     lsm6ds3tr_c_odr_g_t *val);

int32_t lsm6ds3tr_c_block_data_update_set(stmdev_ctx_t *ctx,
                                          uint8_t val);
int32_t lsm6ds3tr_c_block_data_update_get(stmdev_ctx_t *ctx,
                                          uint8_t *val);

typedef enum
{
  LSM6DS3TR_C_LSb_1mg   = 0,
  LSM6DS3TR_C_LSb_16mg  = 1,
  LSM6DS3TR_C_WEIGHT_ND = 2,
} lsm6ds3tr_c_usr_off_w_t;
int32_t lsm6ds3tr_c_xl_offset_weight_set(stmdev_ctx_t *ctx,
                                         lsm6ds3tr_c_usr_off_w_t val);
int32_t lsm6ds3tr_c_xl_offset_weight_get(stmdev_ctx_t *ctx,
                                         lsm6ds3tr_c_usr_off_w_t *val);

