SaraEye/SaraKIT-dsPIC33-bldc-gimbal-motors-with-encoders-SPI-DMA/lsm6ds3tr-c_reg.h
typedef enum
{
  LSM6DS3TR_C_XL_HIGH_PERFORMANCE  = 0,
  LSM6DS3TR_C_XL_NORMAL            = 1,
  LSM6DS3TR_C_XL_PW_MODE_ND        = 2,    /* ERROR CODE */
} lsm6ds3tr_c_xl_hm_mode_t;
int32_t lsm6ds3tr_c_xl_power_mode_set(stmdev_ctx_t *ctx,
                                      lsm6ds3tr_c_xl_hm_mode_t val);
int32_t lsm6ds3tr_c_xl_power_mode_get(stmdev_ctx_t *ctx,
                                      lsm6ds3tr_c_xl_hm_mode_t *val);

typedef enum
{
  LSM6DS3TR_C_GY_HIGH_PERFORMANCE  = 0,
  LSM6DS3TR_C_GY_NORMAL            = 1,
  LSM6DS3TR_C_GY_PW_MODE_ND        = 2,    /* ERROR CODE */
} lsm6ds3tr_c_g_hm_mode_t;

typedef enum
{
  LSM6DS3TR_C_BYPASS_MODE           = 0,
  LSM6DS3TR_C_FIFO_MODE             = 1,
  LSM6DS3TR_C_STREAM_TO_FIFO_MODE   = 3,
  LSM6DS3TR_C_BYPASS_TO_STREAM_MODE = 4,
  LSM6DS3TR_C_STREAM_MODE           = 6,
  LSM6DS3TR_C_FIFO_MODE_ND          = 8,    /* ERROR CODE */
} lsm6ds3tr_c_fifo_mode_t;

typedef enum
{
  LSM6DS3TR_C_XL_ANA_BW_1k5Hz = 0,
  LSM6DS3TR_C_XL_ANA_BW_400Hz = 1,
  LSM6DS3TR_C_XL_ANA_BW_ND    = 2,    /* ERROR CODE */
} lsm6ds3tr_c_bw0_xl_t;
int32_t lsm6ds3tr_c_xl_filter_analog_set(stmdev_ctx_t *ctx,
                                         lsm6ds3tr_c_bw0_xl_t val);
typedef enum
{
  LSM6DS3TR_C_XL_LP1_ODR_DIV_2 = 0,
  LSM6DS3TR_C_XL_LP1_ODR_DIV_4 = 1,
  LSM6DS3TR_C_XL_LP1_NA        = 2,  /* ERROR CODE */
} lsm6ds3tr_c_lpf1_bw_sel_t;
int32_t lsm6ds3tr_c_xl_lp1_bandwidth_set(stmdev_ctx_t *ctx,lsm6ds3tr_c_lpf1_bw_sel_t val);

int32_t lsm6ds3tr_c_device_id_get(stmdev_ctx_t *ctx, uint8_t *buff);
int32_t lsm6ds3tr_c_reset_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3tr_c_reset_get(stmdev_ctx_t *ctx, uint8_t *val);
int32_t lsm6ds3tr_c_fifo_mode_set(stmdev_ctx_t *ctx,
                                  lsm6ds3tr_c_fifo_mode_t val);

typedef enum
{
  LSM6DS3TR_C_XL_LOW_LAT_LP_ODR_DIV_50     = 0x00,
  LSM6DS3TR_C_XL_LOW_LAT_LP_ODR_DIV_100    = 0x01,
  LSM6DS3TR_C_XL_LOW_LAT_LP_ODR_DIV_9      = 0x02,
  LSM6DS3TR_C_XL_LOW_LAT_LP_ODR_DIV_400    = 0x03,
  LSM6DS3TR_C_XL_LOW_NOISE_LP_ODR_DIV_50   = 0x10,
  LSM6DS3TR_C_XL_LOW_NOISE_LP_ODR_DIV_100  = 0x11,
  LSM6DS3TR_C_XL_LOW_NOISE_LP_ODR_DIV_9    = 0x12,
  LSM6DS3TR_C_XL_LOW_NOISE_LP_ODR_DIV_400  = 0x13,
  LSM6DS3TR_C_XL_LP_NA                     = 0x20, /* ERROR CODE */
} lsm6ds3tr_c_input_composite_t;
int32_t lsm6ds3tr_c_xl_lp2_bandwidth_set(stmdev_ctx_t *ctx,
                                         lsm6ds3tr_c_input_composite_t val);

typedef enum
{
  LSM6DS3TR_C_LP2_ONLY                    = 0x00,

  LSM6DS3TR_C_HP_16mHz_LP2                = 0x80,
  LSM6DS3TR_C_HP_65mHz_LP2                = 0x90,
  LSM6DS3TR_C_HP_260mHz_LP2               = 0xA0,
  LSM6DS3TR_C_HP_1Hz04_LP2                = 0xB0,

  LSM6DS3TR_C_HP_DISABLE_LP1_LIGHT        = 0x0A,
  LSM6DS3TR_C_HP_DISABLE_LP1_NORMAL       = 0x09,
  LSM6DS3TR_C_HP_DISABLE_LP_STRONG        = 0x08,
  LSM6DS3TR_C_HP_DISABLE_LP1_AGGRESSIVE   = 0x0B,

  LSM6DS3TR_C_HP_16mHz_LP1_LIGHT          = 0x8A,
  LSM6DS3TR_C_HP_65mHz_LP1_NORMAL         = 0x99,
  LSM6DS3TR_C_HP_260mHz_LP1_STRONG        = 0xA8,
  LSM6DS3TR_C_HP_1Hz04_LP1_AGGRESSIVE     = 0xBB,

  LSM6DS3TR_C_HP_GY_BAND_NA               = 0xFF,    /* ERROR CODE */
} lsm6ds3tr_c_lpf1_sel_g_t;
int32_t lsm6ds3tr_c_gy_band_pass_set(stmdev_ctx_t *ctx,
                                     lsm6ds3tr_c_lpf1_sel_g_t val);
int32_t lsm6ds3tr_c_status_reg_get(stmdev_ctx_t *ctx,
                                   lsm6ds3tr_c_status_reg_t *val);
int32_t lsm6ds3tr_c_temperature_raw_get(stmdev_ctx_t *ctx,
                                        int16_t *val);
int32_t lsm6ds3tr_c_angular_rate_raw_get(stmdev_ctx_t *ctx,
                                         int16_t *val);
int32_t lsm6ds3tr_c_acceleration_raw_get(stmdev_ctx_t *ctx,
                                         int16_t *val);


#ifdef __cplusplus
}
#endif

#endif /* LSM6DS3TR_C_DRIVER_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
